#+title: Restart again, going in the right direction
#+date: <2023-02-11 19:51>
#+description:
#+filetags:


Hopefully it's just the vectors and the build.

* First Error

#+begin_example
,*** ERROR IN hash-copy! -- Operator is not a PROCEDURE
(#!void '#<table #2> '#<table #3>)
> ,b
0  hash-copy!
1  hash-copy!
2  /home/drewc/me/MuKn/src/gerbil.js/gerbil/bootstrap/lib/gerbil/compiler/compile__0.scm# "../bootstrap/lib/gerbil/compiler/compile__0.scm"@90:10
3  ##force-out-of-line
4  /home/drewc/me/MuKn/src/gerbil.js/gerbil/bootstrap/lib/gerbil/compiler/optimize-xform__0.scm#
5  ##force-out-of-line
6  gxc#apply-collect-mutators
7  gxc#optimize!
8  gxc#compile-top-module
9  for-each
10 (interaction)           "build/build1.ss"@80:2  (compile-group gerbil-mod...
11 ##load
12 ##load
13 ##main-gsi/gsc
>
#+end_example

That's pretty easy.

Our thing has this

#+begin_src scheme
(define (hash-copy! hd . rest)
  (for-each (lambda (r) (table-merge! hd r)) rest)
  hd)
#+end_src

#+begin_src sh :results verbatim :wrap example
  PATH=$PATH:$(cd ../bin && pwd)

  echo First the C gambit
  gsi -e '(apropos "table-merge!")'
  echo; echo Then the JS gambit
  gsi-js -e '(apropos "table-merge!")'

  echo; echo doh;

#+end_src

#+RESULTS:
#+begin_example
First the C gambit
"##" namespace:
  table-merge!
empty namespace:
  table-merge!

Then the JS gambit

doh
#+end_example

So what does it do?

#+begin_src scheme
  (define-prim (##table-merge! table1
                             table2
                             #!optional
                             (table2-takes-precedence? #f))
  (if table2-takes-precedence?
      (##table-for-each
       (lambda (k v)
         (##table-set! table1 k v))
       table2)
      (##table-for-each
       (lambda (k v)
         (if (##eq? (##table-ref table1 k (macro-unused-obj))
                    (macro-unused-obj))
             (##table-set! table1 k v)))
       table2))
  table1)
#+end_src


And we have just the solution.

#+begin_src scheme
  (begin
    (define (table-merge! table1
                          table2
                          #!optional
                          (table2-takes-precedence? #f))
      (if table2-takes-precedence?
          (table-for-each
           (lambda (k v)
             (table-set! table1 k v))
           table2)
          (table-for-each
           (lambda (k v)
             (if (eq? (table-ref table1 k (macro-unused-obj))
                      (macro-unused-obj))
                 (table-set! table1 k v)))
           table2))
      table1))
#+end_src

* It works?

#+begin_src bash :session gxjs-restart
  export GXJS_HOME=$(cd ../ && pwd)
  echo 'GXJS_HOME='$GXJS_HOME
#+end_src

#+RESULTS:
|                                             |
| GXJS_HOME=/home/drewc/me/MuKn/src/gerbil.js |

#+begin_src bash :session gxjs-restart
  export GXJS_BIN=$GXJS_HOME/bin
  export GERBIL_GSC=$GXJS_BIN/gsc
  export GERBIL_GSI=$GXJS_BIN/gsi-js
#+end_src

The issue is still like last time. Bytecode namespace.

The debugging prints show us this.

#+begin_example
gxc#verboseinvoke gsc (gsc -target js -module-ref gerbil/prelude/core.ss /home/drewc/me/MuKn/src/gerbil.js/gerbil/lib/gerbil/core__16.scm)
gx-open-process {
  path: '/home/drewc/me/MuKn/src/gerbil.js/bin/../gambit/gsc/gsc',
  arguments: [
    '-target',
    'js',
    '-module-ref',
    'gerbil/prelude/core.ss',
    '/home/drewc/me/MuKn/src/gerbil.js/gerbil/lib/gerbil/core__16.scm'
  ],
  'stdout-redirection': false
}
#+end_example

That's the 17th file thus far with the same module ref.

Let's give it a go another way. in =gxc#gsc-compile-file= we fudge the args to account for that and hopefully never reuse a module-ref

#+begin_src scheme
  (define gxjs-module-refs (make-hash-table))
  (define (make-module-ref mr n)
    ;; (displayln "make mod ref" mr n)
    (let ((nmr (string-append mr n)))
      (if (hash-ref gxjs-module-refs nmr #f)
          (make-module-ref nmr "_")
          nmr)))

  (define (make-gsc-args args)
    ;; (displayln "make gsc args" args)
    (let* ((mr-cons
            (let mr ((kons args))
              (if (and (pair? kons)
                       (equal? "-module-ref" (car kons)))
                  kons
                  (if (null? kons) (error "No module-ref in " args)
                      (mr (cdr kons))))))
           (path (last args))
           (strlen (string-length path))
           (possible-number (gxjs-name->number-string path))
           (module-ref (make-module-ref (cadr mr-cons) possible-number)))
      (set-cdr! mr-cons (cons module-ref (cddr mr-cons))))
    ;; (displayln "Args " args)
    ;; (displayln "Module Ref" (cadr mr-cons))
    ;; (displayln  ":Nom?" possible-number)
    args)
#+end_src
#+RESULTS:

